In [1]:
import numpy as np
import pandas as pd

In [2]:
'''
diferença entre séries do pandas e os arrays do numpy
series podem ser acessadas por labels
'''

'\ndiferença entre séries do pandas e os arrays do numpy\nseries podem ser acessadas por labels\n'

In [3]:
#dictionary
dictio = {'a':1, 'b':2, 'c': 3}
#lista
lista = ['a', 1, 2.3, 'fim da lista']
#array
arr = np.array([1, 2, 3, 4])
#series
ser = pd.Series(data=['dado1', 'dado2', 3], index=['primeiro', 'segundo', 3])

# Operações dão resultados estranhos com Series
    O pandas tenta encontrar labels que combinem
    quando não acha, transforma o dado em NaN

In [4]:
ser1 = pd.Series(['USA', 'BR', 'JP', 'ARG'], [1, 2, 3, 4])
ser2 = pd.Series(['CAN', 'BR', 'JP', 'RUSS'], [1, 2, 50, 20])
ser1 + ser2
#1 e 2 somaram BRs e USA+CAN, o resto não conseguiu encontrar label compatível

1     USACAN
2       BRBR
3        NaN
4        NaN
20       NaN
50       NaN
dtype: object

In [5]:
ser2*3

1        CANCANCAN
2           BRBRBR
50          JPJPJP
20    RUSSRUSSRUSS
dtype: object

In [6]:
ser1 = pd.Series([1, 2, 3, 4],  ['USA', 'BR', 'JP', 'GER'])
ser2 = pd.Series([1, 2, 50, 20], ['CAN', 'BR', 'JP', 'RUSS'])
ser1 + ser2
#BR e JP somaram, o resto não conseguiu encontrar uma label compatível

BR       4.0
CAN      NaN
GER      NaN
JP      53.0
RUSS     NaN
USA      NaN
dtype: float64

In [9]:
ser1 * ser2

BR        4.0
CAN       NaN
GER       NaN
JP      150.0
RUSS      NaN
USA       NaN
dtype: float64

In [10]:
ser1*3

USA     3
BR      6
JP      9
GER    12
dtype: int64

# Dataframes
    entenda cada coluna e cada linha de um Dataframe como uma Série
    todas as colunas de um Dataframe possuem as mesmas labels (viram indexes)

In [11]:
#new
df = pd.DataFrame(data=[['Brasil', 12, 1], ['Japão', 13, 0],],
                  index = ['c1', 'c2'],
                  columns=['país', 'número', 'Coluna pra ser dropada'])
df

      país  número  Coluna pra ser dropada
c1  Brasil      12                       1
c2   Japão      13                       0

In [12]:
#drop
df.drop(labels='Coluna pra ser dropada', axis=1)

      país  número
c1  Brasil      12
c2   Japão      13

In [13]:
df

      país  número  Coluna pra ser dropada
c1  Brasil      12                       1
c2   Japão      13                       0

## inplace
    O argumento 'inplace' é importante para muitos métodos do Pandas
    Se o inplace=False, as modificações não acontecem no objeto, apenas em uma 'view' dele.
    Algo parecido com o slice do numpy

In [14]:
#axis=0 -> dropa linha; axis=1 -> dropa coluna
df.drop(labels='Coluna pra ser dropada', axis=1, inplace=True)
df

      país  número
c1  Brasil      12
c2   Japão      13

In [15]:
#acessando coluna
#retorna uma Series
df['país']

c1    Brasil
c2     Japão
Name: país, dtype: object

In [16]:
#acessando linha
#também retorna Series
#acessando por label
df.loc['c1']

país      Brasil
número        12
Name: c1, dtype: object

In [17]:
#acessando por index
df.iloc[1]

país      Japão
número       13
Name: c2, dtype: object

In [18]:
df = pd.DataFrame(data=[['Brasil', 12, 1, 'olá', 1.2],
                        ['Japão', 13, 0, 'tchau', 4.0],
                        ['Cadaná', 22, 3, 'hello', 20.0],
                        ['EUA', 33, 0, 'hey', ]],
                  columns=['país', 'número', 'whatevr', 'falando', 'isso'])
df

     país  número  whatevr falando  isso
0  Brasil      12        1     olá   1.2
1   Japão      13        0   tchau   4.0
2  Cadaná      22        3   hello  20.0
3     EUA      33        0     hey   NaN

In [19]:
df.loc[0]['país']

'Brasil'

In [20]:
df.loc[:, :'falando']

     país  número  whatevr falando
0  Brasil      12        1     olá
1   Japão      13        0   tchau
2  Cadaná      22        3   hello
3     EUA      33        0     hey

In [21]:
df.iloc[1, 0]

'Japão'

In [22]:
df.iloc[1:,3:]

  falando  isso
1   tchau   4.0
2   hello  20.0
3     hey   NaN

In [23]:
df['nova_col'] = df['número'] + df['whatevr']
df

     país  número  whatevr falando  isso  nova_col
0  Brasil      12        1     olá   1.2        13
1   Japão      13        0   tchau   4.0        13
2  Cadaná      22        3   hello  20.0        25
3     EUA      33        0     hey   NaN        33

In [24]:
df[df['país'] == 'Japão']

    país  número  whatevr falando  isso  nova_col
1  Japão      13        0   tchau   4.0        13

In [25]:
#condicional dentro da busca
df[df['número'] > 12]

     país  número  whatevr falando  isso  nova_col
1   Japão      13        0   tchau   4.0        13
2  Cadaná      22        3   hello  20.0        25
3     EUA      33        0     hey   NaN        33

In [26]:
## duplo brackets para múltiplas colunas
df[['número','nova_col']] > 13

   número  nova_col
0   False     False
1   False     False
2    True      True
3    True      True

In [27]:
#pegando apenas colunas com condicional
#duplo bracket no filtro composto de colunas
df[df['número']<13][['país', 'isso']]

     país  isso
0  Brasil   1.2

## filtro com múltiplas condicionais é diferente
    use & ao invés de 'and' para multiplas condicionais em dataframes
    use | e não 'or'
    isso pq cada condicional retorna uma Série de bool e não apenas True ou False.
    E não se esqueça dos parêntesis

In [28]:
#não use and, use &
df[(df['número']<13) & (df['nova_col'] < 15)]

     país  número  whatevr falando  isso  nova_col
0  Brasil      12        1     olá   1.2        13

In [29]:
#não use or, use |
df[(df['número']<13) | (df['nova_col'] < 15)]

     país  número  whatevr falando  isso  nova_col
0  Brasil      12        1     olá   1.2        13
1   Japão      13        0   tchau   4.0        13

# (python) Função zip

In [31]:
a = [1, 2, 3, 4]
b = ['um', 'dois', 'três']
c = [('a', 'b'), ('c', 'd'), ('e', 'f')]

In [32]:
lista_zipada = list(zip(a, b, c))
lista_zipada

[(1, 'um', ('a', 'b')), (2, 'dois', ('c', 'd')), (3, 'três', ('e', 'f'))]

In [33]:
lista1, lista2, lista3 = zip(*lista_zipada)

In [34]:
lista1

(1, 2, 3)

In [35]:
lista3

(('a', 'b'), ('c', 'd'), ('e', 'f'))

# dataframes com index multinível

In [36]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index) # -> essa função é necessária

In [37]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [38]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.227749 -1.512637
   2  1.675868 -1.460101
   3 -0.284981  0.004080
G2 1 -0.227785 -0.389858
   2 -0.382228  1.364685
   3 -0.493914 -0.808204

In [39]:
df.loc['G1'].loc[2]['B']

-1.4601013787603794

## cross-section
    permite pular o index externo e selecionar linhas de index internos

In [40]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    1.227749 -1.512637
       2    1.675868 -1.460101
       3   -0.284981  0.004080
G2     1   -0.227785 -0.389858
       2   -0.382228  1.364685
       3   -0.493914 -0.808204

In [41]:
# perceba que recuperamos dados tanto de G1 quanto de G2.
df.xs(1, level='Num')

               A         B
Groups
G1      1.227749 -1.512637
G2     -0.227785 -0.389858

# Groupby com Pandas

In [42]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Salary': [10000, 20000, 13000, 12000, 23000, 10000]}

In [43]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  Salary
0    GOOG      Sam    200   10000
1    GOOG  Charlie    120   20000
2    MSFT      Amy    340   13000
3    MSFT  Vanessa    124   12000
4      FB     Carl    243   23000
5      FB    Sarah    350   10000

In [44]:
df.groupby('Company').sum()

         Sales  Salary
Company
FB         593   33000
GOOG       320   30000
MSFT       464   25000

In [45]:
df.groupby('Company').count()

         Person  Sales  Salary
Company
FB            2      2       2
GOOG          2      2       2
MSFT          2      2       2

In [46]:
df.groupby('Company')['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Mergineg vs Join
    merge é usado para juntar DataFrames baseando-se em alguma coluna
    Join é usado para junter DataFrames baseando-se nos indexes

In [47]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [48]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [49]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [50]:
# merge usa a coluna key como referência
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [51]:
df_a = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

df_b = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [52]:
df_a

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [53]:
df_b

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [57]:
#inner join pega só o que as tabelas têm em comum -> indexes k0 e k2 aparecem em ambos.
df_a.join(df_b, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [58]:
#outer join pega tudo, preenchendo os vazios com NaN
df_a.join(df_b, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operações

## apply
    semelhante ao map do python
    list(map(lambda var:var**2, [1, 2, 3, 4]))
    -> [1, 4, 9, 16]

In [68]:
def times_2(num):
    return num*2
df

  Company   Person  Sales  Salary
0    GOOG      Sam    200   10000
1    GOOG  Charlie    120   20000
2    MSFT      Amy    340   13000
3    MSFT  Vanessa    124   12000
4      FB     Carl    243   23000
5      FB    Sarah    350   10000

In [69]:
df['Sales'].apply(times_2)

0    400
1    240
2    680
3    248
4    486
5    700
Name: Sales, dtype: int64

In [76]:
#tabém pode ser usada com lambda
df['Person'].apply(lambda x:x.lower())

0        sam
1    charlie
2        amy
3    vanessa
4       carl
5      sarah
Name: Person, dtype: object

In [79]:
df.sort_values('Sales', inplace=True)

In [80]:
df

  Company   Person  Sales  Salary
1    GOOG  Charlie    120   20000
3    MSFT  Vanessa    124   12000
0    GOOG      Sam    200   10000
4      FB     Carl    243   23000
2    MSFT      Amy    340   13000
5      FB    Sarah    350   10000

# pivot tables
    útil quando quando perceber que o problema pode ser transformado em multilevel index
    ótimo para organizar os dados de uma maneira bastante diferente, transformando dados de uma linha em coluna

In [88]:
data = {'A':['São Paulo','Flamengo','Santos','São Paulo','Flamengo','Santos'],
     'B':['Brasileirão','Brasileirão','Copa do Brasil','Copa do Brasil','Brasileirão','Brasileirão'],
       'C':['Gols','Gols sofridos','Gols','Gols sofridos','Gols','Gols sofridos'],
       'D':[3,3,2,0,4,1]}

df = pd.DataFrame(data)
df

           A               B              C  D
0  São Paulo     Brasileirão           Gols  3
1   Flamengo     Brasileirão  Gols sofridos  3
2     Santos  Copa do Brasil           Gols  2
3  São Paulo  Copa do Brasil  Gols sofridos  0
4   Flamengo     Brasileirão           Gols  4
5     Santos     Brasileirão  Gols sofridos  1

In [89]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C                         Gols  Gols sofridos
A         B
Flamengo  Brasileirão      4.0            3.0
Santos    Brasileirão      NaN            1.0
          Copa do Brasil   2.0            NaN
São Paulo Brasileirão      3.0            NaN
          Copa do Brasil   NaN            0.0